devdnl/dnx-rtos/src/system/drivers/sdio/stm32f7/sdio.c
/*==============================================================================
File    sdio.c

Author  Daniel Zorychta

Brief   SD Card Interface Driver.

        Copyright (C) 2021 Daniel Zorychta <daniel.zorychta@gmail.com>

        This program is free software; you can redistribute it and/or modify
        it under the terms of the GNU General Public License as published by
        the Free Software Foundation and modified by the dnx RTOS exception.

        NOTE: The modification  to the GPL is  included to allow you to
              distribute a combined work that includes dnx RTOS without
              being obliged to provide the source  code for proprietary
              components outside of the dnx RTOS.

        The dnx RTOS  is  distributed  in the hope  that  it will be useful,
        but WITHOUT  ANY  WARRANTY;  without  even  the implied  warranty of
        MERCHANTABILITY  or  FITNESS  FOR  A  PARTICULAR  PURPOSE.  See  the
        GNU General Public License for more details.

        Full license text is available on the following file: doc/license.txt.

==============================================================================*/

/*==============================================================================
  Include files
==============================================================================*/
#include "drivers/driver.h"
#include "stm32f7/dma_ddi.h"
#include "sys/ioctl.h"
#include "../sdio_ioctl.h"
#include "stm32f7xx_hal_sd.h"

/*==============================================================================
  Local macros
==============================================================================*/
#define MTX_TIMEOUT                     2500

#define _SDIO_MODE_POLLING              0
#define _SDIO_MODE_IRQ                  1
#define _SDIO_MODE_DMA                  2

/*==============================================================================
  Local object types
==============================================================================*/
enum {
        #if defined(SDMMC1)
        SD1,
        #endif
        #if defined(SDMMC2)
        SD2,
        #endif
        SD_COUNT
};

/** driver instance associated with partition */
typedef struct {
        u8_t major;
        u8_t minor;
        SD_HandleTypeDef hsd;
        u64_t card_size;
        mutex_t *mtx;
        sem_t *sem_xfer_complete;
        bool irq_yield;
} SDIO_t;

typedef struct {
        SDMMC_TypeDef *instance;
        __IO u32_t    *RCC_APBENR;
        u32_t          RCC_APBENR_SDMMCEN;
        IRQn_Type      IRQn;
        u32_t          IRQ_priority;
        u32_t          card_timeout;
        u32_t          clock_edge;
        u32_t          clock_power_save;
        u32_t          clock_div;
        u32_t          bus_wide;
        u32_t          hardware_flow_ctrl;
        u32_t          mode;
} sd_info_t;

/*==============================================================================
  Local function prototypes
==============================================================================*/
static int card_initialize(SDIO_t *hdl);
static int card_wait_ready(SDIO_t *hdl);

/*==============================================================================
  Local object
==============================================================================*/
MODULE_NAME(SDIO);

/*
 * For IRQ purpose only.
 */
static SDIO_t *sdio[SD_COUNT];

/*
 * SDMMCx configuration.
 */
static const sd_info_t SDMMC[] = {
        #if defined(SDMMC1)
        {
                .instance = SDMMC1,
                .RCC_APBENR = &RCC->APB2ENR,
                .RCC_APBENR_SDMMCEN = RCC_APB2ENR_SDMMC1EN,
                .IRQn = SDMMC1_IRQn,
                .IRQ_priority = __SDIO_CFG_SDMMC1_IRQ_PRIORITY__,
                .card_timeout = __SDIO_CFG_SDMMC1_CARD_TIMEOUT__,
                .clock_edge = __SDIO_CFG_SDMMC1_CLOCK_EDGE__,
                .clock_power_save = __SDIO_CFG_SDMMC1_PWRSAVE__,
                .clock_div = __SDIO_CFG_SDMMC1_CKDIV__ - 1,
                .bus_wide = __SDIO_CFG_SDMMC1_BUS_WIDE__,
                .hardware_flow_ctrl = __SDIO_CFG_SDMMC1_HW_FLOW_CTRL__,
                .mode = __SDIO_CFG_SDMMC1_MODE__,
        },
        #endif
        #if defined(SDMMC2)
        {
                .instance = SDMMC2,
                .RCC_APBENR = &RCC->APB2ENR,
                .RCC_APBENR_SDMMCEN = RCC_APB2ENR_SDMMC2EN,
                .IRQn = SDMMC2_IRQn,
                .IRQ_priority = __SDIO_CFG_SDMMC2_IRQ_PRIORITY__,
                .card_timeout = __SDIO_CFG_SDMMC2_CARD_TIMEOUT__,
                .clock_edge = __SDIO_CFG_SDMMC2_CLOCK_EDGE__,
                .clock_power_save = __SDIO_CFG_SDMMC2_PWRSAVE__,
                .clock_div = __SDIO_CFG_SDMMC2_CKDIV__ - 1,
                .bus_wide = __SDIO_CFG_SDMMC2_BUS_WIDE__,
                .hardware_flow_ctrl = __SDIO_CFG_SDMMC2_HW_FLOW_CTRL__,
                .mode = __SDIO_CFG_SDMMC2_MODE__,
        }
        #endif
};

/*==============================================================================
  Exported object
==============================================================================*/

/*==============================================================================
  Function definitions
==============================================================================*/

//==============================================================================
/**
 * @brief Initialize device.
 *
 * @param[out]          **device_handle        device allocated memory
 * @param[in ]            major                major device number
 * @param[in ]            minor                minor device number
 * @param[in ]            config               optional module configuration
 *
 * @return One of errno value (errno.h).
 */
//==============================================================================
API_MOD_INIT(SDIO, void **device_handle, u8_t major, u8_t minor, const void *config)
{
        UNUSED_ARG1(config);

        int err = ENODEV;

