devdnl/dnx-rtos/src/system/drivers/sdio/stm32f7/sdio.c
        if ((major < SD_COUNT) && (minor == 0)) {
                err = sys_zalloc(sizeof(SDIO_t), device_handle);
                if (!err) {
                        SDIO_t *hdl = *device_handle;
                        hdl->major = major;
                        hdl->minor = minor;

                        err = sys_semaphore_create(1, 0, &hdl->sem_xfer_complete);
                        if (!err) {

                                err = sys_mutex_create(MUTEX_TYPE_RECURSIVE, &hdl->mtx);
                                if (!err) {
                                        err = card_initialize(hdl);
                                        if (!err) {
                                                sdio[hdl->major] = hdl;
                                                return err;
                                        }

                                        sys_mutex_destroy(hdl->mtx);
                                }

                                sys_semaphore_destroy(hdl->sem_xfer_complete);
                        }

                        sys_free(*device_handle);
                }
        }

        return err;
}

//==============================================================================
/**
 * @brief Release device.
 *
 * @param[in ]          *device_handle          device allocated memory
 *
 * @return One of errno value (errno.h).
 */
//==============================================================================
API_MOD_RELEASE(SDIO, void *device_handle)
{
        SDIO_t *hdl = device_handle;

        mutex_t *mtx = hdl->mtx;

        int err = sys_mutex_lock(mtx, MTX_TIMEOUT);
        if (!err) {
                hdl->mtx = NULL;
                sys_sleep_ms(MTX_TIMEOUT + 500);
                HAL_SD_DeInit(&hdl->hsd);
                sys_mutex_unlock(mtx);
                sys_mutex_destroy(hdl->mtx);
                sys_free(device_handle);
                sdio[hdl->major] = NULL;
        }

        return err;
}

//==============================================================================
/**
 * @brief Open device.
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[in ]           flags                  file operation flags (O_RDONLY, O_WRONLY, O_RDWR)
 *
 * @return One of errno value (errno.h).
 */
//==============================================================================
API_MOD_OPEN(SDIO, void *device_handle, u32_t flags)
{
        UNUSED_ARG2(device_handle, flags);
        return ESUCC;
}

//==============================================================================
/**
 * @brief Close device.
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[in ]           force                  device force close (true)
 *
 * @return One of errno value (errno.h).
 */
//==============================================================================
API_MOD_CLOSE(SDIO, void *device_handle, bool force)
{
        UNUSED_ARG2(device_handle, force);
        return ESUCC;
}

//==============================================================================
/**
 * @brief Write data to device.
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[in ]          *src                    data source
 * @param[in ]           count                  number of bytes to write
 * @param[in ][out]     *fpos                   file position
 * @param[out]          *wrcnt                  number of written bytes
 * @param[in ]           fattr                  file attributes
 *
 * @return One of errno value (errno.h).
 */
//==============================================================================
API_MOD_WRITE(SDIO,
              void             *device_handle,
              const u8_t       *src,
              size_t            count,
              fpos_t           *fpos,
              size_t           *wrcnt,
              struct vfs_fattr  fattr)
{
        UNUSED_ARG1(fattr);

        SDIO_t *hdl = device_handle;

        int err = sys_mutex_lock(hdl->mtx, MTX_TIMEOUT);
        if (!err) {
                if (((*fpos & (BLOCKSIZE - 1)) == 0) and ((count & (BLOCKSIZE - 1)) == 0)) {

                        u32_t block_address = *fpos / BLOCKSIZE;
                        u32_t blocks        = count / BLOCKSIZE;

                        if (SDMMC[hdl->major].mode == _SDIO_MODE_POLLING) {

                                err = HAL_SD_WriteBlocks(&hdl->hsd, src, block_address, blocks,
                                                         SDMMC[hdl->major].card_timeout);

                        } else if (SDMMC[hdl->major].mode == _SDIO_MODE_IRQ) {

                                err = HAL_SD_WriteBlocks_IT(&hdl->hsd, src, block_address, blocks);
                                if (!err) {
                                        err = sys_semaphore_wait(hdl->sem_xfer_complete,
                                                                 SDMMC[hdl->major].card_timeout);
                                }

                        } else if (SDMMC[hdl->major].mode == _SDIO_MODE_DMA) {

                                dev_dbg(hdl, "DMA not supported yet!", 0);
                                err = EFAULT;

                        } else {
                                err = EFAULT;
                                dev_dbg(hdl, "unknown card mode!", 0);
                        }

                        if (!err) {
                                err = card_wait_ready(hdl);
                                if (!err) {
                                        *wrcnt += count;
                                } else {
                                        dev_dbg(hdl, "card busy at write transfer", 0);
                                }
                        }

                } else {
                        err = EINVAL;
                }

                sys_mutex_unlock(hdl->mtx);
        }

        return err;
}

//==============================================================================
/**
 * @brief Read data from device.
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[out]          *dst                    data destination
 * @param[in ]           count                  number of bytes to read
 * @param[in ][out]     *fpos                   file position
 * @param[out]          *rdcnt                  number of read bytes
 * @param[in ]           fattr                  file attributes
 *
 * @return One of errno value (errno.h).
 */
//==============================================================================
API_MOD_READ(SDIO,
             void            *device_handle,
             u8_t            *dst,
             size_t           count,
             fpos_t          *fpos,
             size_t          *rdcnt,
             struct vfs_fattr fattr)
{
        UNUSED_ARG1(fattr);

