devdnl/dnx-rtos/src/system/drivers/sdio/stm32f7/sdio.c
        SDIO_t *hdl  = device_handle;

        int err = sys_mutex_lock(hdl->mtx, MTX_TIMEOUT);
        if (!err) {
                if (((*fpos & (BLOCKSIZE - 1)) == 0) and ((count & (BLOCKSIZE - 1)) == 0)) {

                        u32_t block_address = *fpos / BLOCKSIZE;
                        u32_t blocks        = count / BLOCKSIZE;

                        if (SDMMC[hdl->major].mode == _SDIO_MODE_POLLING) {

                                err = HAL_SD_ReadBlocks(&hdl->hsd, dst, block_address, blocks,
                                                        SDMMC[hdl->major].card_timeout);

                        } else if (SDMMC[hdl->major].mode == _SDIO_MODE_IRQ) {

                                err = HAL_SD_ReadBlocks_IT(&hdl->hsd, dst, block_address, blocks);
                                if (!err) {
                                        err = sys_semaphore_wait(hdl->sem_xfer_complete,
                                                                 SDMMC[hdl->major].card_timeout);
                                }

                        } else if (SDMMC[hdl->major].mode == _SDIO_MODE_DMA) {

                                dev_dbg(hdl, "DMA not supported yet!", 0);
                                err = EFAULT;

                        } else {
                                err = EFAULT;
                                dev_dbg(hdl, "unknown card mode!", 0);
                        }

                        if (!err) {
                                err = card_wait_ready(hdl);
                                if (!err) {
                                        *rdcnt += count;
                                } else {
                                        dev_dbg(hdl, "card busy at read transfer", 0);
                                }
                        }

                } else {
                        err = EINVAL;
                }

                sys_mutex_unlock(hdl->mtx);
        }

        return err;
}

//==============================================================================
/**
 * @brief IO control.
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[in ]           request                request
 * @param[in ][out]     *arg                    request's argument
 *
 * @return One of errno value (errno.h).
 */
//==============================================================================
API_MOD_IOCTL(SDIO, void *device_handle, int request, void *arg)
{
        UNUSED_ARG1(arg);

        SDIO_t *hdl = device_handle;

        int err = EBADRQC;

        switch (request) {
        case IOCTL_SDIO__INITIALIZE_CARD: {
                err = sys_mutex_lock(hdl->mtx, MAX_DELAY_MS);
                if (!err) {
                        err = card_initialize(hdl);
                        sys_mutex_unlock(hdl->mtx);
                }
                break;
        }

        case IOCTL_SDIO__READ_MBR: {
//                err = sys_mutex_lock(hdl->ctrl->protect, MAX_DELAY_MS);
//                if (!err) {
//                        if (hdl->ctrl->initialized) {
//                                err = MBR_detect_partitions(hdl);
//                        } else {
//                                err = ENOMEDIUM;
//                        }
//                        sys_mutex_unlock(hdl->ctrl->protect);
//                }
                break;
        }

        default:
                return EBADRQC;
        }

        return err;
}

//==============================================================================
/**
 * @brief Flush device.
 *
 * @param[in ]          *device_handle          device allocated memory
 *
 * @return One of errno value (errno.h).
 */
//==============================================================================
API_MOD_FLUSH(SDIO, void *device_handle)
{
        UNUSED_ARG1(device_handle);

        return ESUCC;
}

//==============================================================================
/**
 * @brief Device information.
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[out]          *device_stat            device status
 *
 * @return One of errno value (errno.h).
 */
//==============================================================================
API_MOD_STAT(SDIO, void *device_handle, struct vfs_dev_stat *device_stat)
{
        SDIO_t *hdl = device_handle;

        device_stat->st_size = hdl->card_size;

        return ESUCC;
}

//==============================================================================
/**
 * @brief  Basic interface initialization.
 *
 * @param  hsd          SD handle
 */
//==============================================================================
void HAL_SD_MspInit(SD_HandleTypeDef *hsd)
{
        SDIO_t *hdl = hsd->CtxPtr;

        u8_t major = 0;

        if (hsd->Instance == SDMMC1) {
                major = 0;
#ifdef SDMMC2
        } else if (hsd->Instance == SDMMC2) {
                major = 1;
#endif
        } else {
                dev_dbg(hdl, "init: unknown SDMMC instance", 0);
                return;
        }

        SET_BIT(*SDMMC[major].RCC_APBENR, SDMMC[major].RCC_APBENR_SDMMCEN);

        if (SDMMC[major].mode != _SDIO_MODE_POLLING) {
                NVIC_SetPriority(SDMMC[major].IRQn, SDMMC[major].IRQ_priority);
                NVIC_ClearPendingIRQ(SDMMC[major].IRQn);
                NVIC_EnableIRQ(SDMMC[major].IRQn);
        }
}

//==============================================================================
/**
 * @brief  Basic interface de-initialization.
 *
 * @param  hsd          SD handle
 */
//==============================================================================
void HAL_SD_MspDeInit(SD_HandleTypeDef *hsd)
{
        SDIO_t *hdl = hsd->CtxPtr;

        u8_t major = 0;

        if (hsd->Instance == SDMMC1) {
                major = 0;
#ifdef SDMMC2
        } else if (hsd->Instance == SDMMC2) {
                major = 1;
#endif
        } else {
                dev_dbg(hdl, "deinit: unknown SDMMC instance", 0);
                return;
        }

        NVIC_ClearPendingIRQ(SDMMC[major].IRQn);
        NVIC_DisableIRQ(SDMMC[major].IRQn);

