devdnl/dnx-rtos/src/system/drivers/sdio/stm32f7/sdio.c
        CLEAR_BIT(*SDMMC[major].RCC_APBENR, SDMMC[major].RCC_APBENR_SDMMCEN);
}

//==============================================================================
/**
 * @brief  Card initialization.
 *
 * @param  hdl          device handle
 *
 * @return One of errno value (errno.h).
 */
//==============================================================================
static int card_initialize(SDIO_t *hdl)
{
        hdl->hsd.CtxPtr = hdl;

        hdl->hsd.Instance = SDMMC[hdl->major].instance;
        hdl->hsd.Init.ClockEdge = SDMMC[hdl->major].clock_edge;
        hdl->hsd.Init.ClockBypass = SDMMC_CLOCK_BYPASS_DISABLE;
        hdl->hsd.Init.ClockPowerSave = SDMMC[hdl->major].clock_power_save;
        hdl->hsd.Init.BusWide = SDMMC_BUS_WIDE_1B;
        hdl->hsd.Init.HardwareFlowControl = SDMMC[hdl->major].hardware_flow_ctrl;
        hdl->hsd.Init.ClockDiv = SDMMC[hdl->major].clock_div;

        HAL_SD_DeInit(&hdl->hsd);

        int err = HAL_SD_Init(&hdl->hsd);
        if (!err) {

                const char *mode = "?";
                switch (SDMMC[hdl->major].mode) {
                case _SDIO_MODE_POLLING: mode = "polling"; break;
                case _SDIO_MODE_IRQ:     mode = "IRQ"; break;
                case _SDIO_MODE_DMA:     mode = "DMA"; break;
                }
                dev_dbg(hdl, "selected %s mode", mode);

                if (SDMMC[hdl->major].bus_wide != SDMMC_BUS_WIDE_1B) {
                        if (HAL_SD_ConfigWideBusOperation(&hdl->hsd, SDMMC_BUS_WIDE_4B) == SD_HAL_OK) {
                                dev_dbg(hdl, "switched to 4-bit bus", 0);
                        } else {
                                dev_dbg(hdl, "4-bit bus not supported", 0);
                        }
                }

                HAL_SD_CardInfoTypeDef info;
                err = HAL_SD_GetCardInfo(&hdl->hsd, &info);
                if (!err) {

                        dev_dbg(hdl, "found SD%s card",
                                info.CardType == CARD_SDSC ? "SC" : "HC/XC");

                        dev_dbg(hdl, "%d %u-byte logical blocks",
                               info.BlockNbr, info.BlockSize);

                        hdl->card_size = cast(u64_t, info.BlockSize)
                                       * cast(u64_t, info.BlockNbr);

                } else {
                        HAL_SD_DeInit(&hdl->hsd);
                }
        }

        return err;
}

//==============================================================================
/**
 * @brief  Wait for card to be ready.
 *
 * @param  hdl          device handle
 *
 * @return One of errno value (errno.h).
 */
//==============================================================================
static int card_wait_ready(SDIO_t *hdl)
{
        int err = 0;

        size_t timeout = SDMMC[hdl->major].card_timeout / 10;

        HAL_SD_CardStateTypeDef state;
        while ((state = HAL_SD_GetCardState(&hdl->hsd)) != HAL_SD_CARD_TRANSFER) {

                sys_sleep_ms(1);

                if (--timeout == 0) {
                        err = ETIME;
                        break;
                }
        }

        return err;
}

//==============================================================================
/**
 * @brief  Rx complete callback.
 *
 * @param  hsd          SD handle
 */
//==============================================================================
void HAL_SD_RxCpltCallback(SD_HandleTypeDef *hsd)
{
        SDIO_t *hdl = hsd->CtxPtr;
        sys_semaphore_signal_from_ISR(hdl->sem_xfer_complete, &hdl->irq_yield);
}

//==============================================================================
/**
 * @brief  Tx complete callback.
 *
 * @param  hsd          SD handle
 */
//==============================================================================
void HAL_SD_TxCpltCallback(SD_HandleTypeDef *hsd)
{
        SDIO_t *hdl = hsd->CtxPtr;
        sys_semaphore_signal_from_ISR(hdl->sem_xfer_complete, &hdl->irq_yield);
}

//==============================================================================
/**
 * @brief  SDMMC1 IRQ handler.
 */
//==============================================================================
#if defined(SDMMC1) && (__SDIO_CFG_SDMMC1_MODE__ != _SDIO_MODE_POLLING)
void SDMMC1_IRQHandler(void)
{
        if (sdio[SD1]) {
                HAL_SD_IRQHandler(&sdio[SD1]->hsd);
        }

        sys_thread_yield_from_ISR(&sdio[SD1]->irq_yield);
}
#endif

//==============================================================================
/**
 * @brief  SDMMC2 IRQ handler.
 */
//==============================================================================
#if defined(SDMMC2) && (__SDIO_CFG_SDMMC2_MODE__ != _SDIO_MODE_POLLING)
void SDMMC2_IRQHandler(void)
{
        if (sdio[SD2]) {
                HAL_SD_IRQHandler(&sdio[SD2]->hsd);
        }

        sys_thread_yield_from_ISR(&sdio[SD2]->irq_yield);
}
#endif

/*==============================================================================
  End of file
==============================================================================*/
